In [1]:
import os
import pandas as pd

In [2]:
path = os.path.join("Resources", "purchase_data.csv")

In [3]:
df = pd.read_csv(path)

In [4]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [5]:
### Player Count

#Total Number of Players

In [6]:
df["SN"].nunique()

576

In [7]:
### Purchasing Analysis (Total)

#* Number of Unique Items
#* Average Purchase Price
#* Total Number of Purchases
#* Total Revenue

In [8]:
df["Item ID"].nunique()

183

In [9]:
df["Price"].mean()

3.0509871794871795

In [10]:
df["Purchase ID"].nunique()

780

In [11]:
df["Price"].sum()

2379.77

In [12]:
### Gender Demographics

#* Percentage and Count of Male Players
#* Percentage and Count of Female Players
#* Percentage and Count of Other / Non-Disclosed

In [13]:
df.groupby("Gender").agg({'SN':["nunique", lambda x: x.nunique() / df["SN"].nunique() * 100]})

                           SN
                      nunique <lambda_0>
Gender
Female                     81  14.062500
Male                      484  84.027778
Other / Non-Disclosed      11   1.909722

In [14]:
### Purchasing Analysis (Gender)

#* The below each broken by gender
 # * Purchase Count
  #* Average Purchase Price
  #* Total Purchase Value
  #* Average Purchase Total per Person by Gender

In [15]:
df.groupby("Gender").agg({"Item ID": ["count"], "Price": ["mean", "sum"]})

                      Item ID     Price
                        count      mean      sum
Gender
Female                    113  3.203009   361.94
Male                      652  3.017853  1967.64
Other / Non-Disclosed      15  3.346000    50.19

In [16]:
### Age Demographics

#* The below each broken into bins of 4 years (i.e. &lt;10, 10-14, 15-19, etc.)
 # * Purchase Count
  #* Average Purchase Price
  #* Total Purchase Value
  #* Average Purchase Total per Person by Age Group

In [30]:
#bin_series = pd.cut(df["Age"], [0, 10, 14, 19, 24, 29, 34, 39, 40], labels=["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"])

In [81]:
bin_series = pd.cut(df["Age"], bins=[0, 9, 14, 19, 24, 29, 34, 39, 99], labels=["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"])
#add a new column category next to the age group. 
#category = pd.cut(df.Age,bins=[0,2,17,65,99],labels=['Toddler/baby','Child','Adult','Elderly'])

In [89]:
df.groupby(bin_series)["SN"].nunique()

Age
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [82]:
df.groupby(bin_series).agg({"Item ID": ["count"], "Price": ["mean", "sum"]})

      Item ID     Price
        count      mean      sum
Age
<10        23  3.353478    77.13
10-14      28  2.956429    82.78
15-19     136  3.035956   412.89
20-24     365  3.052219  1114.06
25-29     101  2.900990   293.00
30-34      73  2.931507   214.00
35-39      41  3.601707   147.67
40+        13  2.941538    38.24

In [ ]:
 pd.cut(np.array([1, 7, 5, 4, 6, 3]),
...        3, labels=["bad", "medium", "good"])
    agg_df = df.groupby(bins_series)["description"].count()
    In order to bucket your series, you should use the pd.cut() function, like this:

df['bin'] = pd.cut(df['1'], [0, 50, 100,200])

         0    1        file         bin
0  person1   24     age.csv     (0, 50]
1  person2   17     age.csv     (0, 50]
2  person3   98     age.csv   (50, 100]
3  person4    6     age.csv     (0, 50]
4  person2  166  Height.csv  (100, 200]
5  person3  125  Height.csv  (100, 200]
6  person5  172  Height.csv  (100, 200]
If you want to name the bins yourself, you can use the labels= argument, like this:

df['bin'] = pd.cut(df['1'], [0, 50, 100,200], labels=['0-50', '50-100', '100-200'])

In [ ]:
### Top Spenders

#* Identify the the top 5 spenders in the game by total purchase value, then list (in a table):
 # * SN
  #* Purchase Count
  #* Average Purchase Price
  #* Total Purchase Value

In [97]:
df.groupby("SN").agg({"SN": ["count"], "Price": ["mean", "sum"]})

                 SN     Price
              count      mean   sum
SN
Adairialis76      1  2.280000  2.28
Adastirin33       1  4.480000  4.48
Aeda94            1  4.910000  4.91
Aela59            1  4.320000  4.32
Aelaria33         1  1.790000  1.79
...             ...       ...   ...
Yathecal82        3  2.073333  6.22
Yathedeu43        2  3.010000  6.02
Yoishirrala98     1  4.580000  4.58
Zhisrisu83        2  3.945000  7.89
Zontibe81         3  2.676667  8.03

[576 rows x 3 columns]